{
    "id": "dragonmap",
    "name": "DragonMap - An Interactive Drexel Campus Map",
    "start_date": "2012-03-01",
    "end_date": "2012-07-01",
    "contributors": [
        {
            "name": "Drew Banin",
            "link": "http://drewbanin.com"
        },
        {
            "name": "Russell Wiley",
            "link": "www.linkedin.com/pub/russell-wiley/49/2b8/27a"
        },
        {
            "name": "William Mongan",
            "link": "https://www.cs.drexel.edu/~wmm24/index.html"
        }
    ],
    "short_desc": "DragonMap is an interactive Drexel University campus map for your mobile phone. Within the app, you are able to move around the map, touch buildings in order bring up information, and search for different points of interest around campus.",
    "long_desc": [
        {
            "section_name": "Introduction",
            "content": "DragonMap was a project that I worked on during my freshman year at Drexel for my Engineering Design Lab course.  I worked with two other students, Drew Banin and Rusell Wiley, under Professor William Mongan and the goal of the project was to create a mobile application which would help students find their way around campus as there was no real pre-existing soltuion that had a significant amount of features.  Although the maintanence of the database for this project has been abandoned, the application is fully working and still in the Google Play store!"
        },
        {
            "section_name": "Problem Overview",
            "content": "The Drexel University Campus is constantaly changing, and it is hard to keep track of the new buildings and what they are used for. On top of this, many buildings around campus are as confusing as mazes, and it is very easy to get lost in them."
        },
        {
            "section_name": "Design Constraints",
            "content": "The DragonMap mobile app must be able to run on almost all modern Android phones. The development of the app must be done in Java and XML using the Android SDK. The team must also attain a very high-resolution version of an up-to-date Drexel map."
        },
        {
            "section_name": "Pre-Existing Solutions",
            "content": "There have been other attempts to make an app like this, but because of conflicting features, they were not fully developed. The DrexelOne app offers a map feature that brings up a google map veiw with pins on it. However, when you tap the pin, it simply brings up the building name. This is the extent of this app, which is not very useful."
        },
        {
            "section_name": "Design Goals",
            "content": "We hoped that this app would have a very significant amount of functionality. The primary goal was to be able to easily search for a building code, room number, or point of interest and have it come up on the map with information on that place. In the event that we have extra time (and the ability to attain them), we would have liked to have been able to introduce floor plans of each building into the app as well as GPS."
        },
        {
            "section_name": "Project Deliverables",
            "content": "Our deliverables were a fully functioning Drexel Map app with wonderfully commented code. We also developed a database and an easy-update system for the admins of the app. Since we would like to develop an app that Drexel can take control of, we must also give them a way to change information when new buildings are added constructed on campus."
        }
    ],
    "languages": [
        "Java",
        "Python",
        "JSON",
        "XML",
        "Android SDK"
    ],
    "images": {
        "banner": "assets/images/portfolio/banner/dragonmap.jpg",
        "frontpage": "assets/images/portfolio/frontpage/dragonmap.jpg",
        "gallery": "assets/images/portfolio/gallery/dragonmap.jpg",
        "feature": [
            "assets/images/portfolio/images/dragonmap1.jpg",
            "assets/images/portfolio/images/dragonmap2.jpg",
            "assets/images/portfolio/images/dragonmap3.jpg",
            "assets/images/portfolio/images/dragonmap4.jpg",
            "assets/images/portfolio/images/dragonmap5.jpg",
            "assets/images/portfolio/images/dragonmap6.jpg",
            "assets/images/portfolio/images/dragonmap7.jpg"
        ]
    },
    "videos": [
        "http://www.youtube.com/watch?v=4t4-nLVg0qY"
    ]
}