{
    "name": "LiveNote: Orchestral Music Companion",
    "start_date": "2012-08-01",
    "end_date": "2013-07-01",
    "contributors": [
        {
            "name": "MET-Lab",
            "link": "http://music.ece.drexel.edu"
        },
        {
            "name": "Matthew Prockup",
            "link": "mailto:mprockup@drexel.edu"
        },
        {
            "name": "The Philadelphia Orchestra",
            "link": "http://www.philorch.org"
        }
    ],
    "short_desc": "The LiveNote Authoring System is a content management system for iNotes, an orchestral annotation application which was done in collaboaration with the Philadelphia Orchestra.",
    "long_desc": [
        {
            "section_name": "About the Project",
            "content": "During the summer after my Freshman year, I took part in the STAR (Students Tackling Advanced Research) program, where I did work in the MET-Lab (Music, Entertainment, and Technology Laboratory) with iNotes.\niNotes is a system that helps users by guiding them through the performance using a handheld application in real-time. Using audio features, we attempt to align the live performance audio with that of a previously annotated reference recording. The aligned position is transmitted to users handheld devices and pre-annotated information about the piece is displayed synchronously with the performance.\nMy contribution to the project was the creation of a content management system, called the iNotes authoring system, which allowed experts from the Orchestra to easily write their own annotations for each piece.  Alongside this, the system also allowed the Orchestra to manually advance annotations in the event that the automatic detection of concert location were to fail.\nThis project was my introduction to using actual databases, and how to efficiently call databases in combination with storing data in session.  After a year of dedication to the project, it is now effectively in the hands of the Philadelphia Orchestra.\n\nYou can find the official project page on the MET-Lab website at http://music.ece.drexel.edu/research/LiveNote"
        }
    ],
    "languages": [
        "PHP",
        "MySQL",
        "JavaScript",
        "jQuery",
        "HTML",
        "CSS"
    ],
    "images": {
        "banner": "assets/images/portfolio/banner/inotes.jpg",
        "frontpage": "assets/images/portfolio/frontpage/inotes.jpg",
        "gallery": "assets/images/portfolio/gallery/inotes.jpg",
        "feature": [
            "assets/images/portfolio/images/inotes1.jpg",
            "assets/images/portfolio/images/inotes2.jpg",
            "assets/images/portfolio/images/inotes3.jpg",
            "assets/images/portfolio/images/inotes4.jpg",
            "assets/images/portfolio/images/inotes6.jpg"
        ]
    }
}