{
    "id": "rmdrink",
    "name": "The Rick and Morty Drinking Game",
    "start_date": "2015-10-02",
    "end_date": "2015-10-06",
    "contributors": [
    ],
    "short_desc": "The unofficial drinking game website that I made for the TV show Rick and Morty (on Adult Swim).  While it took a while to come up with the rules, I built the site in about a night.  It was a fun way to see how quickly I could build out a single-page application.  It now has over 13,000 visitors!",
    "long_desc": [
        {
            "section_name": "Links",
            "content": "The site: http://rickandmortydrinkinggame.com\nThe code: http://github.com/markkohdev/riggitywrecked"
        },
        {
            "section_name": "About the Project",
            "content": "The unofficial drinking game website that I made for the TV show Rick and Morty (on Adult Swim).  While it took a while to come up with the rules, I built the site in about a night.  It was a fun way to see how quickly I could build out a single-page application.  It now has over 13,000 visitors!"
        },
        {
            "section_name": "Building the Site",
            "content": "To start off, I used the gulp-angular yeoman generator to lay out the groundwork for me.  Among a small number of additional packages, the site leverages Angular Material Design and ui-router for the essential functionality.  Using gulp, I was able to easily deploy the sute upon completing and updating it.  While right now the rules for the game are static (fed from an object in the controller) it would be very easy to expand the site to hold user-submitted rules and rules saved in local storage."
        },
        {
            "section_name": "Google Analytics: The DATA!!",
            "content": "One of the big goals of this project was to play around a bit with Google Analytics and Angular.  While working at RJMetrics I got to play with GA data pretty frequently seeing as I spent some time on the team which replicated data from the Google Analytics API.  But I wanted more!  I wanted to have my own data to play with!  So I threw this site on reddit, facebook, and sent it to a few friends.  I released the site on the morning of the season 2 finale, and by the time the episode had finished the site had over 10,000 visitors.  Needless to say I was pretty happy with the result, and now I have a GA dashboard with lots of numbers!  Woohoo!"
        }
    ],
    "languages": [
        "AngularJS",
        "Javascript",
        "SASS",
        "HTML"
    ],
    "images": {
    }
}